Raul-dot-valdez/aws-iot-device-sdk-embedded-C/papr/hal/gd32e503ce/papr_hal_gd32e503ce.c
/* HAL implementation for the GigaDevice GD32E503CE.
 *
 *   Core      : Cortex-M33 with FPU
 *   Package   : LQFP48 (~37 GPIOs)
 *   Flash/RAM : 256 KB / 64 KB
 *
 * This is an alternative MCU port: the application's HAL contract
 * (include/papr_hal.h) is identical to the GD32E517RE port, so papr_core
 * runs unchanged on either chip. Only the chip-specific peripheral setup,
 * pin assignments, and 256 KB flash map differ.
 *
 * The file targets the GigaDevice GD32E50x firmware library (gd32e50x.h
 * and the matching peripheral drivers). CMake includes it only when
 * PAPR_TARGET=GD32E503CE and pulls in startup_gd32e503_xb.s plus the
 * vendor SDK from GD32E50X_SDK_DIR. */

#ifdef GD32E50X

#include "gd32e50x.h"
#include "papr_config.h"
#include "papr_hal.h"
#include "papr_pinmap.h"
#include "papr_secure.h"
#include "papr_sha256.h"

#include <string.h>

/* ------------------------------------------------------------------------- */
/* Globals                                                                   */
/* ------------------------------------------------------------------------- */

static volatile uint32_t s_tick_ms;
static volatile bool     s_diag_pending;
static volatile uint32_t s_diag_edge_ms;
static volatile uint16_t s_tacho_rpm;

#define TACHO_SAMPLE_PERIOD_MS  100U

#define ADC_VREF_MV             3300U
#define ADC_FULL_SCALE          4095U

#define VBAT_DIV_NUM            220U
#define VBAT_DIV_DEN            43U

#define IBAT_MA_PER_COUNT_NUM   1U
#define IBAT_MA_PER_COUNT_DEN   3U

#define FLOW_FULL_SCALE_LPM     250U

/* ------------------------------------------------------------------------- */
/* Clock and SysTick                                                         */
/* ------------------------------------------------------------------------- */

static void clock_init(void)
{
    /* SystemInit() (vendor) sets the PLL from HXTAL. */
    SysTick_Config(SystemCoreClock / 1000U);
    NVIC_SetPriority(SysTick_IRQn, 0U);
}

void SysTick_Handler(void)
{
    ++s_tick_ms;

    static uint32_t s_last_sample_ms;
    static uint32_t s_last_count;
    if ((s_tick_ms - s_last_sample_ms) >= TACHO_SAMPLE_PERIOD_MS)
    {
        uint32_t count  = (uint32_t)timer_counter_read(PAPR_TACHO_TIMER);
        uint32_t delta  = (uint32_t)(count - s_last_count) & 0xFFFFU;
        s_last_count    = count;
        s_last_sample_ms = s_tick_ms;
        uint32_t rpm = (delta * 600U) / PAPR_L6235_TACHO_PPR;
        if (rpm > 0xFFFFU) { rpm = 0xFFFFU; }
        s_tacho_rpm = (uint16_t)rpm;
    }
}

uint32_t papr_hal_now_ms(void)
{
    return s_tick_ms;
}

/* ------------------------------------------------------------------------- */
/* GPIO bring-up                                                             */
/* ------------------------------------------------------------------------- */

static void gpio_clocks_enable(void)
{
    rcu_periph_clock_enable(RCU_GPIOA);
    rcu_periph_clock_enable(RCU_GPIOB);
    rcu_periph_clock_enable(RCU_GPIOC);
    rcu_periph_clock_enable(RCU_AF);
}

static void l6235_pins_init(void)
{
    gpio_init(PAPR_PIN_L6235_EN_PORT,    GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ,
              PAPR_PIN_L6235_EN_PIN);
    gpio_init(PAPR_PIN_L6235_FWD_PORT,   GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ,
              PAPR_PIN_L6235_FWD_PIN);
    gpio_init(PAPR_PIN_L6235_BRAKE_PORT, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ,
              PAPR_PIN_L6235_BRAKE_PIN);

    gpio_bit_reset(PAPR_PIN_L6235_EN_PORT,    PAPR_PIN_L6235_EN_PIN);
    gpio_bit_reset(PAPR_PIN_L6235_BRAKE_PORT, PAPR_PIN_L6235_BRAKE_PIN);
    gpio_bit_set(  PAPR_PIN_L6235_FWD_PORT,   PAPR_PIN_L6235_FWD_PIN);

    gpio_init(PAPR_PIN_L6235_DIAG_PORT, GPIO_MODE_IPU, GPIO_OSPEED_50MHZ,
              PAPR_PIN_L6235_DIAG_PIN);
    gpio_exti_source_select(PAPR_PIN_L6235_DIAG_EXTI_PORT_SRC,
                            PAPR_PIN_L6235_DIAG_EXTI_SRC);
    exti_init(PAPR_PIN_L6235_DIAG_EXTI, EXTI_INTERRUPT, EXTI_TRIG_FALLING);
    exti_interrupt_flag_clear(PAPR_PIN_L6235_DIAG_EXTI);
    nvic_irq_enable(EXTI10_15_IRQn, 1U, 0U);

    gpio_init(PAPR_PIN_L6235_TACHO_PORT, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ,
              PAPR_PIN_L6235_TACHO_PIN);
}

static void ui_pins_init(void)
{
    gpio_init(PAPR_PIN_BTN_POWER_PORT, GPIO_MODE_IPU, GPIO_OSPEED_50MHZ,
              PAPR_PIN_BTN_POWER_PIN);
    gpio_init(PAPR_PIN_BTN_LEVEL_PORT, GPIO_MODE_IPU, GPIO_OSPEED_50MHZ,
              PAPR_PIN_BTN_LEVEL_PIN);

    gpio_init(PAPR_PIN_LED_OK_PORT,    GPIO_MODE_OUT_PP, GPIO_OSPEED_2MHZ,
              PAPR_PIN_LED_OK_PIN);
    gpio_init(PAPR_PIN_LED_WARN_PORT,  GPIO_MODE_OUT_PP, GPIO_OSPEED_2MHZ,
              PAPR_PIN_LED_WARN_PIN);
    gpio_init(PAPR_PIN_LED_FAULT_PORT, GPIO_MODE_OUT_PP, GPIO_OSPEED_2MHZ,
              PAPR_PIN_LED_FAULT_PIN);
}

/* ------------------------------------------------------------------------- */
/* DAC for L6235 VREF                                                        */
/* ------------------------------------------------------------------------- */

static void dac_init_vref(void)
{
    rcu_periph_clock_enable(RCU_DAC);
    gpio_init(PAPR_PIN_L6235_VREF_PORT, GPIO_MODE_AIN, GPIO_OSPEED_50MHZ,
              PAPR_PIN_L6235_VREF_PIN);

    dac_deinit();
    dac_trigger_disable(PAPR_DAC_CHANNEL);
    dac_wave_mode_config(PAPR_DAC_CHANNEL, DAC_WAVE_DISABLE);
    dac_output_buffer_enable(PAPR_DAC_CHANNEL);
    dac_data_set(PAPR_DAC_CHANNEL, DAC_ALIGN_12B_R, 0U);
    dac_enable(PAPR_DAC_CHANNEL);
}

papr_status_t papr_hal_l6235_set_vref(uint16_t code)
{
    if (code > PAPR_L6235_VREF_DAC_MAX) { code = PAPR_L6235_VREF_DAC_MAX; }
    uint32_t dac_code = ((uint32_t)code * 4095U) / PAPR_L6235_VREF_DAC_MAX;
    dac_data_set(PAPR_DAC_CHANNEL, DAC_ALIGN_12B_R, (uint16_t)dac_code);
    return PAPR_OK;
}

papr_status_t papr_hal_l6235_set_enable(bool enable)
{
    if (enable) { gpio_bit_set(PAPR_PIN_L6235_EN_PORT, PAPR_PIN_L6235_EN_PIN); }
    else        { gpio_bit_reset(PAPR_PIN_L6235_EN_PORT, PAPR_PIN_L6235_EN_PIN); }
    return PAPR_OK;
}

