Raul-dot-valdez/aws-iot-device-sdk-embedded-C/papr/hal/gd32e503ce/papr_hal_gd32e503ce.c
papr_status_t papr_hal_i2c_read(uint8_t addr7, uint8_t *data, size_t len)
{
    if (data == NULL || len == 0U) { return PAPR_ERR_PARAM; }
    papr_status_t s = wait_busy_clear();
    if (s != PAPR_OK) { return s; }

    i2c_ack_config(PAPR_I2C_PERIPH, I2C_ACK_ENABLE);
    i2c_ackpos_config(PAPR_I2C_PERIPH, I2C_ACKPOS_CURRENT);
    i2c_start_on_bus(PAPR_I2C_PERIPH);
    s = wait_flag(I2C_FLAG_SBSEND);
    if (s != PAPR_OK) { return s; }
    i2c_master_addressing(PAPR_I2C_PERIPH, (uint32_t)(addr7 << 1), I2C_RECEIVER);
    s = wait_flag(I2C_FLAG_ADDSEND);
    if (s != PAPR_OK) { return s; }
    i2c_flag_clear(PAPR_I2C_PERIPH, I2C_FLAG_ADDSEND);

    for (size_t i = 0U; i < len; ++i)
    {
        if (i + 1U == len)
        {
            i2c_ack_config(PAPR_I2C_PERIPH, I2C_ACK_DISABLE);
            i2c_stop_on_bus(PAPR_I2C_PERIPH);
        }
        s = wait_flag(I2C_FLAG_RBNE);
        if (s != PAPR_OK) { return s; }
        data[i] = (uint8_t)i2c_data_receive(PAPR_I2C_PERIPH);
    }
    i2c_ack_config(PAPR_I2C_PERIPH, I2C_ACK_ENABLE);
    return PAPR_OK;
}

/* ------------------------------------------------------------------------- */
/* Buttons                                                                   */
/* ------------------------------------------------------------------------- */

bool papr_hal_button_power_pressed(void)
{
    return gpio_input_bit_get(PAPR_PIN_BTN_POWER_PORT,
                              PAPR_PIN_BTN_POWER_PIN) == RESET;
}

bool papr_hal_button_level_pressed(void)
{
    return gpio_input_bit_get(PAPR_PIN_BTN_LEVEL_PORT,
                              PAPR_PIN_BTN_LEVEL_PIN) == RESET;
}

papr_status_t papr_hal_led_set(uint8_t led_id, bool on)
{
    uint32_t port;
    uint32_t pin;
    switch (led_id)
    {
        case 0U: port = PAPR_PIN_LED_OK_PORT;    pin = PAPR_PIN_LED_OK_PIN;    break;
        case 1U: port = PAPR_PIN_LED_WARN_PORT;  pin = PAPR_PIN_LED_WARN_PIN;  break;
        case 2U: port = PAPR_PIN_LED_FAULT_PORT; pin = PAPR_PIN_LED_FAULT_PIN; break;
        default: return PAPR_ERR_PARAM;
    }
    if (on) { gpio_bit_set(port, pin); } else { gpio_bit_reset(port, pin); }
    return PAPR_OK;
}

/* ------------------------------------------------------------------------- */
/* 3x3 switch matrix                                                         */
/* ------------------------------------------------------------------------- */

static const uint32_t s_keypad_row_ports[PAPR_KEYPAD_ROWS] = {
    PAPR_PIN_KEYPAD_ROW0_PORT, PAPR_PIN_KEYPAD_ROW1_PORT, PAPR_PIN_KEYPAD_ROW2_PORT
};
static const uint32_t s_keypad_row_pins[PAPR_KEYPAD_ROWS] = {
    PAPR_PIN_KEYPAD_ROW0_PIN,  PAPR_PIN_KEYPAD_ROW1_PIN,  PAPR_PIN_KEYPAD_ROW2_PIN
};
static const uint32_t s_keypad_col_ports[PAPR_KEYPAD_COLS] = {
    PAPR_PIN_KEYPAD_COL0_PORT, PAPR_PIN_KEYPAD_COL1_PORT, PAPR_PIN_KEYPAD_COL2_PORT
};
static const uint32_t s_keypad_col_pins[PAPR_KEYPAD_COLS] = {
    PAPR_PIN_KEYPAD_COL0_PIN,  PAPR_PIN_KEYPAD_COL1_PIN,  PAPR_PIN_KEYPAD_COL2_PIN
};

static void keypad_init(void)
{
    for (uint8_t r = 0U; r < PAPR_KEYPAD_ROWS; ++r)
    {
        gpio_init(s_keypad_row_ports[r], GPIO_MODE_OUT_OD, GPIO_OSPEED_2MHZ,
                  s_keypad_row_pins[r]);
        gpio_bit_set(s_keypad_row_ports[r], s_keypad_row_pins[r]);
    }
    for (uint8_t c = 0U; c < PAPR_KEYPAD_COLS; ++c)
    {
        gpio_init(s_keypad_col_ports[c], GPIO_MODE_IPU, GPIO_OSPEED_2MHZ,
                  s_keypad_col_pins[c]);
    }
}

papr_status_t papr_hal_keypad_drive_row(uint8_t row, bool active)
{
    if (row >= PAPR_KEYPAD_ROWS) { return PAPR_ERR_PARAM; }
    if (active) { gpio_bit_reset(s_keypad_row_ports[row], s_keypad_row_pins[row]); }
    else        { gpio_bit_set(s_keypad_row_ports[row],   s_keypad_row_pins[row]); }
    return PAPR_OK;
}

bool papr_hal_keypad_read_col(uint8_t col)
{
    if (col >= PAPR_KEYPAD_COLS) { return false; }
    return gpio_input_bit_get(s_keypad_col_ports[col],
                              s_keypad_col_pins[col]) == RESET;
}

/* ------------------------------------------------------------------------- */
/* Buzzer (TIMER2_CH0 PWM)                                                   */
/* ------------------------------------------------------------------------- */

static void buzzer_init(void)
{
    rcu_periph_clock_enable(RCU_TIMER2);
    gpio_init(PAPR_PIN_BUZZER_PORT, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ,
              PAPR_PIN_BUZZER_PIN);

    timer_deinit(PAPR_BUZZER_TIMER);
    timer_parameter_struct cfg;
    timer_struct_para_init(&cfg);
    cfg.prescaler        = (uint16_t)((SystemCoreClock / 1000000U) - 1U);
    cfg.alignedmode      = TIMER_COUNTER_EDGE;
    cfg.counterdirection = TIMER_COUNTER_UP;
    cfg.period           = 1000U;
    cfg.clockdivision    = TIMER_CKDIV_DIV1;
    timer_init(PAPR_BUZZER_TIMER, &cfg);

    timer_oc_parameter_struct oc;
    timer_channel_output_struct_para_init(&oc);
    oc.outputstate  = TIMER_CCX_ENABLE;
    oc.ocpolarity   = TIMER_OC_POLARITY_HIGH;
    oc.ocidlestate  = TIMER_OC_IDLE_STATE_LOW;
    timer_channel_output_config(PAPR_BUZZER_TIMER, PAPR_BUZZER_TIMER_CH, &oc);
    timer_channel_output_mode_config(PAPR_BUZZER_TIMER, PAPR_BUZZER_TIMER_CH,
                                     TIMER_OC_MODE_PWM0);
    timer_channel_output_pulse_value_config(PAPR_BUZZER_TIMER,
                                            PAPR_BUZZER_TIMER_CH, 0U);
    timer_primary_output_config(PAPR_BUZZER_TIMER, ENABLE);
    timer_enable(PAPR_BUZZER_TIMER);
}

papr_status_t papr_hal_buzzer_set(bool on, uint16_t freq_hz)
{
    if (!on || freq_hz == 0U)
    {
        timer_channel_output_pulse_value_config(PAPR_BUZZER_TIMER,
                                                PAPR_BUZZER_TIMER_CH, 0U);
        return PAPR_OK;
    }
    uint32_t period = 1000000U / (uint32_t)freq_hz;
    if (period < 2U) { period = 2U; }
    timer_autoreload_value_config(PAPR_BUZZER_TIMER, (uint16_t)(period - 1U));
    timer_channel_output_pulse_value_config(PAPR_BUZZER_TIMER,
                                            PAPR_BUZZER_TIMER_CH,
                                            (uint16_t)(period / 2U));
    return PAPR_OK;
}

/* ------------------------------------------------------------------------- */
/* USART0 transport for the GD32VW553 BLE module                             */
/* ------------------------------------------------------------------------- */

#define BLE_RX_RING_LEN  256U
static volatile uint8_t  s_ble_rx_buf[BLE_RX_RING_LEN];
static volatile uint16_t s_ble_rx_head;
static volatile uint16_t s_ble_rx_tail;

static void ble_uart_init(void)
{
    rcu_periph_clock_enable(RCU_USART0);

    gpio_init(PAPR_PIN_UART_TX_PORT, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ,
              PAPR_PIN_UART_TX_PIN);
    gpio_init(PAPR_PIN_UART_RX_PORT, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ,
              PAPR_PIN_UART_RX_PIN);

    gpio_init(PAPR_PIN_BLE_RESET_PORT, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ,
              PAPR_PIN_BLE_RESET_PIN);
    gpio_bit_reset(PAPR_PIN_BLE_RESET_PORT, PAPR_PIN_BLE_RESET_PIN);

    gpio_init(PAPR_PIN_BLE_WAKE_PORT, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ,
              PAPR_PIN_BLE_WAKE_PIN);

