Raul-dot-valdez/aws-iot-device-sdk-embedded-C/papr/hal/gd32e503ce/papr_hal_gd32e503ce.c
    usart_deinit(PAPR_UART_PERIPH);
    usart_baudrate_set(PAPR_UART_PERIPH, PAPR_BLE_UART_BAUD);
    usart_word_length_set(PAPR_UART_PERIPH, USART_WL_8BIT);
    usart_stop_bit_set(PAPR_UART_PERIPH, USART_STB_1BIT);
    usart_parity_config(PAPR_UART_PERIPH, USART_PM_NONE);
    usart_hardware_flow_rts_config(PAPR_UART_PERIPH, USART_RTS_DISABLE);
    usart_hardware_flow_cts_config(PAPR_UART_PERIPH, USART_CTS_DISABLE);
    usart_receive_config(PAPR_UART_PERIPH, USART_RECEIVE_ENABLE);
    usart_transmit_config(PAPR_UART_PERIPH, USART_TRANSMIT_ENABLE);
    usart_enable(PAPR_UART_PERIPH);

    nvic_irq_enable(USART0_IRQn, 2U, 0U);
    usart_interrupt_enable(PAPR_UART_PERIPH, USART_INT_RBNE);

    s_ble_rx_head = 0U;
    s_ble_rx_tail = 0U;
}

void USART0_IRQHandler(void)
{
    if (usart_interrupt_flag_get(PAPR_UART_PERIPH, USART_INT_FLAG_RBNE) != RESET)
    {
        uint8_t b = (uint8_t)usart_data_receive(PAPR_UART_PERIPH);
        uint16_t next = (uint16_t)((s_ble_rx_head + 1U) % BLE_RX_RING_LEN);
        if (next != s_ble_rx_tail)
        {
            s_ble_rx_buf[s_ble_rx_head] = b;
            s_ble_rx_head = next;
        }
    }
    if (usart_flag_get(PAPR_UART_PERIPH, USART_FLAG_ORERR) != RESET)
    {
        usart_flag_clear(PAPR_UART_PERIPH, USART_FLAG_ORERR);
        (void)usart_data_receive(PAPR_UART_PERIPH);
    }
}

papr_status_t papr_hal_uart_write(const uint8_t *data, size_t len)
{
    if (data == NULL || len == 0U) { return PAPR_ERR_PARAM; }
    for (size_t i = 0U; i < len; ++i)
    {
        uint32_t timeout = 100000U;
        while (usart_flag_get(PAPR_UART_PERIPH, USART_FLAG_TBE) == RESET && --timeout) { }
        if (timeout == 0U) { return PAPR_ERR_TIMEOUT; }
        usart_data_transmit(PAPR_UART_PERIPH, (uint16_t)data[i]);
    }
    uint32_t timeout = 100000U;
    while (usart_flag_get(PAPR_UART_PERIPH, USART_FLAG_TC) == RESET && --timeout) { }
    return (timeout == 0U) ? PAPR_ERR_TIMEOUT : PAPR_OK;
}

bool papr_hal_uart_read_byte(uint8_t *out)
{
    if (out == NULL || s_ble_rx_head == s_ble_rx_tail) { return false; }
    *out = s_ble_rx_buf[s_ble_rx_tail];
    s_ble_rx_tail = (uint16_t)((s_ble_rx_tail + 1U) % BLE_RX_RING_LEN);
    return true;
}

papr_status_t papr_hal_ble_set_reset(bool asserted)
{
    if (asserted) { gpio_bit_reset(PAPR_PIN_BLE_RESET_PORT, PAPR_PIN_BLE_RESET_PIN); }
    else          { gpio_bit_set(PAPR_PIN_BLE_RESET_PORT,   PAPR_PIN_BLE_RESET_PIN); }
    return PAPR_OK;
}

bool papr_hal_ble_host_wake(void)
{
    return gpio_input_bit_get(PAPR_PIN_BLE_WAKE_PORT,
                              PAPR_PIN_BLE_WAKE_PIN) != RESET;
}

/* ------------------------------------------------------------------------- */
/* OTA flash (FMC) — dual-bank application slots                             */
/* ------------------------------------------------------------------------- */
/*
 * 256 KB layout (see boot/boot_shared.h overrides in papr_pinmap.h):
 *   0x08000000  bootloader            ~28 KB
 *   0x08007000  boot-state page          2 KB (mutable)
 *   0x08007800  provisioning page        2 KB
 *   0x08008000  slot A (app)           112 KB  (last 1 KB = signed manifest)
 *   0x08024000  slot B (app)           112 KB  (last 1 KB = signed manifest)
 *   0x08040000  end
 */

static uint32_t ota_running_slot_base(void)
{
    uint32_t vtor = SCB->VTOR;
    return (vtor >= PAPR_SLOT_B_ADDR) ? PAPR_SLOT_B_ADDR : PAPR_SLOT_A_ADDR;
}

static uint32_t ota_staging_base(void)
{
    return (ota_running_slot_base() == PAPR_SLOT_A_ADDR)
            ? PAPR_SLOT_B_ADDR : PAPR_SLOT_A_ADDR;
}

uint32_t papr_hal_ota_slot_size(void)
{
    return PAPR_SLOT_APP_MAX;   /* minus the manifest page */
}

static papr_status_t fmc_program_buf(uint32_t addr, const uint8_t *data, uint32_t len)
{
    for (uint32_t i = 0U; i < len; i += 4U)
    {
        uint32_t word = 0xFFFFFFFFU;
        uint32_t take = ((len - i) >= 4U) ? 4U : (len - i);
        for (uint32_t b = 0U; b < take; ++b) { ((uint8_t *)&word)[b] = data[i + b]; }
        if (fmc_word_program(addr + i, word) != FMC_READY) { return PAPR_ERR_HW; }
    }
    return PAPR_OK;
}

papr_status_t papr_hal_ota_erase(void)
{
    uint32_t base = ota_staging_base();
    fmc_unlock();
    papr_status_t rc = PAPR_OK;
    for (uint32_t off = 0U; off < PAPR_SLOT_SIZE; off += PAPR_FLASH_PAGE)
    {
        if (fmc_page_erase(base + off) != FMC_READY) { rc = PAPR_ERR_HW; break; }
        papr_hal_wdt_kick();
    }
    fmc_lock();
    return rc;
}

papr_status_t papr_hal_ota_write(uint32_t offset, const uint8_t *data, uint32_t len)
{
    if (data == NULL) { return PAPR_ERR_PARAM; }
    fmc_unlock();
    papr_status_t rc = fmc_program_buf(ota_staging_base() + offset, data, len);
    fmc_lock();
    return rc;
}

papr_status_t papr_hal_ota_read(uint32_t offset, uint8_t *data, uint32_t len)
{
    if (data == NULL) { return PAPR_ERR_PARAM; }
    const uint8_t *src = (const uint8_t *)(ota_staging_base() + offset);
    for (uint32_t i = 0U; i < len; ++i) { data[i] = src[i]; }
    return PAPR_OK;
}

static uint8_t ota_staging_slot_index(void)
{
    return (uint8_t)((ota_staging_base() == PAPR_SLOT_A_ADDR) ? 0U : 1U);
}
static uint8_t ota_running_slot_index(void)
{
    return (uint8_t)((ota_running_slot_base() == PAPR_SLOT_A_ADDR) ? 0U : 1U);
}

static void boot_state_read(papr_boot_state_record_t *r)
{
    memcpy(r, (const void *)PAPR_BOOT_STATE_ADDR, sizeof(*r));
    if (r->magic != PAPR_IMG_MAGIC)
    {
        memset(r, 0, sizeof(*r));
        r->magic = PAPR_IMG_MAGIC;
        r->slot_state[0] = PAPR_BOOT_VALID;
        r->slot_state[1] = PAPR_BOOT_EMPTY;
    }
}

static papr_status_t boot_state_write(const papr_boot_state_record_t *r)
{
    fmc_unlock();
    papr_status_t rc = PAPR_OK;
    if (fmc_page_erase(PAPR_BOOT_STATE_ADDR) != FMC_READY) { rc = PAPR_ERR_HW; }
    if (rc == PAPR_OK)
    {
        rc = fmc_program_buf(PAPR_BOOT_STATE_ADDR, (const uint8_t *)r, sizeof(*r));
    }
    fmc_lock();
    return rc;
}

papr_status_t papr_hal_ota_commit(const papr_img_manifest_t *manifest)
{
    if (manifest == NULL) { return PAPR_ERR_PARAM; }

    uint32_t trailer = ota_staging_base() + PAPR_MANIFEST_OFFSET;
    fmc_unlock();
    papr_status_t rc = PAPR_OK;
    if (fmc_page_erase(trailer) != FMC_READY) { rc = PAPR_ERR_HW; }
    if (rc == PAPR_OK)
    {
        rc = fmc_program_buf(trailer, (const uint8_t *)manifest, sizeof(*manifest));
    }
    fmc_lock();
    if (rc != PAPR_OK) { return rc; }

    papr_boot_state_record_t st;
    boot_state_read(&st);
    uint8_t s = ota_staging_slot_index();
    st.slot_state[s]       = PAPR_BOOT_PENDING;
    st.slot_sec_version[s] = manifest->sec_version;
    st.try_count           = 0U;
    return boot_state_write(&st);
}

papr_status_t papr_hal_ota_confirm(void)
{
    papr_boot_state_record_t st;
    boot_state_read(&st);
    uint8_t r = ota_running_slot_index();
    if (st.slot_state[r] == PAPR_BOOT_VALID) { return PAPR_OK; }
    st.slot_state[r] = PAPR_BOOT_VALID;
    st.try_count     = 0U;
    return boot_state_write(&st);
}

void papr_hal_ota_reboot(void)
{
    __disable_irq();
    NVIC_SystemReset();
}

/* ------------------------------------------------------------------------- */
/* Production test / provisioning                                            */
/* ------------------------------------------------------------------------- */

#define GD32_UID_ADDR    0x1FFFF7E8U

bool papr_hal_factory_requested(void)
{
    rcu_periph_clock_enable(RCU_GPIOC);
    gpio_init(PAPR_PIN_TESTMODE_PORT, GPIO_MODE_IPU, GPIO_OSPEED_2MHZ,
              PAPR_PIN_TESTMODE_PIN);
    for (volatile uint32_t i = 0U; i < 10000U; ++i) { (void)i; }
    return gpio_input_bit_get(PAPR_PIN_TESTMODE_PORT,
                              PAPR_PIN_TESTMODE_PIN) == RESET;
}

void papr_hal_unique_id(uint8_t out[12])
{
    if (out == NULL) { return; }
    const volatile uint8_t *uid = (const volatile uint8_t *)GD32_UID_ADDR;
    for (uint8_t i = 0U; i < 12U; ++i) { out[i] = uid[i]; }
}

