Raul-dot-valdez/aws-iot-device-sdk-embedded-C/papr/hal/gd32e503ce/papr_hal_gd32e503ce.c
papr_status_t papr_hal_prov_read(uint8_t *data, uint32_t len)
{
    if (data == NULL) { return PAPR_ERR_PARAM; }
    const uint8_t *src = (const uint8_t *)PAPR_PROVISION_ADDR;
    for (uint32_t i = 0U; i < len; ++i) { data[i] = src[i]; }
    return PAPR_OK;
}

papr_status_t papr_hal_prov_write(const uint8_t *data, uint32_t len)
{
    if (data == NULL || len > PAPR_FLASH_PAGE) { return PAPR_ERR_PARAM; }
    fmc_unlock();
    papr_status_t rc = PAPR_OK;
    if (fmc_page_erase(PAPR_PROVISION_ADDR) != FMC_READY) { rc = PAPR_ERR_HW; }
    if (rc == PAPR_OK)
    {
        rc = fmc_program_buf(PAPR_PROVISION_ADDR, data, len);
    }
    fmc_lock();
    return rc;
}

/* ------------------------------------------------------------------------- */
/* Security services                                                         */
/* ------------------------------------------------------------------------- */

#define SEC_KEY_SESSION_ADDR  (PAPR_PROVISION_ADDR + 0x100U)
#define SEC_KEY_VENDOR_ADDR   (PAPR_PROVISION_ADDR + 0x140U)

papr_status_t papr_hal_sec_key_read(uint8_t key_id, uint8_t *out, uint32_t len)
{
    if (out == NULL || len > PAPR_SEC_KEY_LEN) { return PAPR_ERR_PARAM; }
    uint32_t addr = (key_id == PAPR_KEY_SESSION) ? SEC_KEY_SESSION_ADDR
                  : (key_id == PAPR_KEY_VENDOR)  ? SEC_KEY_VENDOR_ADDR : 0U;
    if (addr == 0U) { return PAPR_ERR_PARAM; }
    const uint8_t *src = (const uint8_t *)addr;
    uint8_t acc = 0xFFU;
    for (uint32_t i = 0U; i < len; ++i) { out[i] = src[i]; acc &= src[i]; }
    return (acc == 0xFFU) ? PAPR_ERR_NOT_READY : PAPR_OK;
}

bool papr_hal_sec_verify(const uint8_t digest[32], const uint8_t *sig, uint32_t sig_len)
{
    if (digest == NULL || sig == NULL || sig_len < 32U) { return false; }
    uint8_t vkey[PAPR_SEC_KEY_LEN];
    if (papr_hal_sec_key_read(PAPR_KEY_VENDOR, vkey, sizeof(vkey)) != PAPR_OK)
    {
        return false;
    }
    uint8_t tag[PAPR_SHA256_DIGEST_LEN];
    papr_hmac_sha256(vkey, sizeof(vkey), digest, 32U, tag);
    memset(vkey, 0, sizeof(vkey));
    return papr_ct_equal(tag, sig, PAPR_SHA256_DIGEST_LEN);
}

papr_status_t papr_hal_rng(uint8_t *out, uint32_t len)
{
    if (out == NULL) { return PAPR_ERR_PARAM; }
    static uint32_t ctr = 0U;
    while (len > 0U)
    {
        uint8_t seed[12 + 4 + 4];
        papr_hal_unique_id(seed);
        uint32_t t = (uint32_t)SysTick->VAL ^ s_tick_ms;
        memcpy(&seed[12], &t, 4);
        memcpy(&seed[16], &ctr, 4);
        ctr++;
        uint8_t block[PAPR_SHA256_DIGEST_LEN];
        papr_sha256(seed, sizeof(seed), block);
        uint32_t n = (len < sizeof(block)) ? len : (uint32_t)sizeof(block);
        memcpy(out, block, n);
        out += n;
        len -= n;
    }
    return PAPR_OK;
}

uint32_t papr_hal_sec_version_get(void)
{
    papr_boot_state_record_t st;
    boot_state_read(&st);
    return st.reserved;
}

papr_status_t papr_hal_sec_version_set(uint32_t version)
{
    papr_boot_state_record_t st;
    boot_state_read(&st);
    if (version <= st.reserved) { return PAPR_OK; }
    st.reserved = version;
    return boot_state_write(&st);
}

papr_status_t papr_hal_secure_lock_debug(void)
{
    fmc_unlock();
    ob_unlock();
    ob_security_protection_config(OB_LSPC);
    ob_lock();
    fmc_lock();
    return PAPR_OK;
}

bool papr_hal_debug_locked(void)
{
    return ob_spc_get() != FMC_NSPC;
}

/* ------------------------------------------------------------------------- */
/* Watchdog                                                                  */
/* ------------------------------------------------------------------------- */

static void wdt_init(void)
{
    rcu_osci_on(RCU_IRC40K);
    while (rcu_flag_get(RCU_FLAG_IRC40KSTB) == RESET) { /* spin */ }
    fwdgt_config(250U, FWDGT_PSC_DIV32);
    fwdgt_enable();
}

void papr_hal_wdt_kick(void)
{
    fwdgt_counter_reload();
}

/* ------------------------------------------------------------------------- */
/* Top-level init                                                            */
/* ------------------------------------------------------------------------- */

papr_status_t papr_hal_init(void)
{
    s_tick_ms      = 0U;
    s_diag_pending = false;
    s_diag_edge_ms = 0U;
    s_tacho_rpm    = 0U;

    clock_init();
    gpio_clocks_enable();
    l6235_pins_init();
    ui_pins_init();
    dac_init_vref();
    tacho_timer_init();
    adc_init_papr();
    i2c_bus_init();
    keypad_init();
    buzzer_init();
    ble_uart_init();
    wdt_init();
    return PAPR_OK;
}

#endif /* GD32E50X */
